dataset_gen/Hole_Size_Change/CE_KH_Openfoam/Design_Point_0/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
defaultFieldValues
(
    volVectorFieldValue U (0 0 0)
    volScalarFieldValue p 1
    volScalarFieldValue T 1
);

regions
(

    boxToCell
    {
        type    boxToCell;
        box     (0 0 0) (0.5 0.5 0.5);
        fieldValues
        (
            volVectorFieldValue U (-0.12967535782146944 -0.47270770858010924 0)
            volScalarFieldValue p 99005.99393936261
            volScalarFieldValue T 407.59643053832394
        );
    }

    boxToCell
    {
        type    boxToCell;
        box     (0.5 0 0) (1.0 0.5 0.5);
        fieldValues
        (
            volVectorFieldValue U (0.021540944920089844 -0.34682760698773385 0)
            volScalarFieldValue p 95395.72622386987
            volScalarFieldValue T 338.772413556689
        );
    }

    boxToCell
    {
        type    boxToCell;
        box     (0 0.5 0) (0.5 1.0 0.5);
        fieldValues
        (
            volVectorFieldValue U (0.22219851944613989 0.20901790913828822 0)
            volScalarFieldValue p 96178.38202178973
            volScalarFieldValue T 371.8298930373607
        );
    }

    boxToCell
    {
        type    boxToCell;
        box     (0.5 0.5 0) (1.0 1.0 0.5);
        fieldValues
        (
            volVectorFieldValue U (0.3002406077717136 -0.3452693170256015 0)
            volScalarFieldValue p 95474.03421724135
            volScalarFieldValue T 369.9078308698117
        );
    }
);

